First, I will start by importing any modules needed for this assignment as well as an image displaying the sql schema we'll be working with.

In [1]:
import pandas as pd
import sqlite3
from IPython.display import Image

Image(url='http://lh4.ggpht.com/_oKo6zFhdD98/SWFPtyfHJFI/AAAAAAAAAMc/GdrlzeBNsZM/s800/ChinookDatabaseSchema1.1.png')

The next step will be to connect to the sqlite database in order to pull any information that we'll need.

In [6]:
chinook = '/Users/stacey/IS362/IS362_Project3/Chinook_Sqlite.sqlite'
con = sqlite3.connect(chinook)

Now that we've connected to the sqlite database, we'll write a script that will get the exact information that we are looking for.  We'll also display that information in a pandas Dataframe.

In [7]:
sql = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title
         FROM Customer
         LEFT JOIN Invoice
         ON Customer.CustomerId = Invoice.CustomerId
         LEFT JOIN InvoiceLine
         ON Invoice.InvoiceId = InvoiceLine.InvoiceId
         LEFT JOIN Track
         ON InvoiceLine.TrackId = Track.TrackId
         LEFT JOIN Album
         ON Track.AlbumId = Album.AlbumId
         ORDER BY Customer.LastName, Customer.FirstName'''

query = pd.read_sql_query(sql, con=con)
query.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas